# Imports

In [1]:
import numpy as np
import pandas as pd

In [2]:
from tabula import read_pdf

In [17]:
import sys
import os
sys.path.append(os.path.abspath('../../Python_Code'))
from CleaningData import Berlin
B = Berlin()

# Functions

# Data Import

In [5]:
data_path = "../../../VdZ_Gesch√§ftsberichte/Berlin/Geschaeftsbericht_AG_2017.pdf"
activa = read_pdf(data_path, pages="all")

Failed to import jpype dependencies. Fallback to subprocess.
No module named 'jpype'

In [6]:
dfs_list = activa

In [7]:
dfs_list[13]

,C.,VERBINDLICHKEITEN,Unnamed: 0,Unnamed: 1
0,1.Erhaltene Anzahlungen auf Bestellungen\r- da...,"89.187,50","88.217,00",NaN
1,2.Verbindlichkeiten aus Lieferungen und Leistu...,"1.867.572,03","1.466.533,15",NaN
2,3.Sonstige Verbindlichkeiten:\r- davon aus Ste...,"979.946,76","850.820,03",NaN
3,Summe Verbindlichkeiten,"2.936.706,29","2.405.570,18",NaN

# 2017

## Eintrittskarten

### Eintrittskarten Zoo

In [13]:
dfs_list[1]

,Tagestickets Zoo,Eintrittskarten 2017,Eintrittskarten 2016,+/- Vorjahr in %
0,Erwachsene,690.974,653.801,6 %
1,NaN,160.409,163.532,NaN
2,Kinder,107.606,101.820,6 %
3,NaN,262.132,211.813,NaN
4,Andere Eintrittsgelder,17.662,23.932,-26 %
5,Summe Tagestickets Zoo,1.238.783,1.154.898,7 %

In [24]:
dfs_list[1]['Tagestickets Zoo'] = ['Erwachsene', 'Ermaesigte', 'Kinder', 'Familien', 'Andere Eintrittsgelder',
                                    'Summe Tagestickets Zoo']
dfs_list[1]

,Tagestickets Zoo,Eintrittskarten 2017,Eintrittskarten 2016,+/- Vorjahr in %
0,Erwachsene,690974.0,653.801,6 %
1,Ermaesigte,160409.0,163.532,NaN
2,Kinder,107606.0,101.820,6 %
3,Familien,262132.0,211.813,NaN
4,Andere Eintrittsgelder,17662.0,23.932,-26 %
5,Summe Tagestickets Zoo,1238783.0,1.154.898,7 %

In [26]:
Tagestickets_Zoo = dfs_list[1]
# Tagestickets_Zoo = str2float(Tagestickets_Zoo, 'Eintrittskarten 2017')
Tagestickets_Zoo = str2float(Tagestickets_Zoo, 'Eintrittskarten 2016')

Tagestickets_Zoo

,Tagestickets Zoo,Eintrittskarten 2017,Eintrittskarten 2016,+/- Vorjahr in %
0,Erwachsene,690974.0,653801.0,6 %
1,Ermaesigte,160409.0,163532.0,NaN
2,Kinder,107606.0,101820.0,6 %
3,Familien,262132.0,211813.0,NaN
4,Andere Eintrittsgelder,17662.0,23932.0,-26 %
5,Summe Tagestickets Zoo,1238783.0,1154898.0,7 %

In [27]:
Tagestickets_Zoo = percentage2float(Tagestickets_Zoo, '+/- Vorjahr in %')
Tagestickets_Zoo

,Tagestickets Zoo,Eintrittskarten 2017,Eintrittskarten 2016,+/- Vorjahr in %
0,Erwachsene,690974.0,653801.0,6.0
1,Ermaesigte,160409.0,163532.0,NaN
2,Kinder,107606.0,101820.0,6.0
3,Familien,262132.0,211813.0,NaN
4,Andere Eintrittsgelder,17662.0,23932.0,-26.0
5,Summe Tagestickets Zoo,1238783.0,1154898.0,7.0

In [ ]:
Tagestickets_Zoo.iloc[1, 3] = -2.0
Tagestickets_Zoo.iloc[3, 3] = 24.0

In [32]:
year = np.ones(len(Tagestickets_Zoo)) * 2017
pastyear = np.ones(len(Tagestickets_Zoo)) * 2016
Tagestickets_Zoo['Jahr'] = year
Tagestickets_Zoo['Vorjahr'] = pastyear

In [44]:
year.astype(int)

array([2017, 2017, 2017, 2017, 2017, 2017])

In [34]:
Tagestickets_Zoo['Jahr'] = Tagestickets_Zoo['Jahr'].astype(int)
Tagestickets_Zoo['Vorjahr'] = Tagestickets_Zoo['Vorjahr'].astype(int)

In [38]:
Tagestickets_Zoo = Tagestickets_Zoo[['Tagestickets Zoo', 'Jahr', 'Eintrittskarten 2017',
                                    'Vorjahr', 'Eintrittskarten 2016', '+/- Vorjahr in %']]
Tagestickets_Zoo = Tagestickets_Zoo.rename(columns={'Eintrittskarten 2017': 'Eintrittskarten',
                                                    'Eintrittskarten 2016': 'Vorjahres Eintrittskarten'})

In [39]:
Tagestickets_Zoo

,Tagestickets Zoo,Jahr,Eintrittskarten,Vorjahr,Vorjahres Eintrittskarten,+/- Vorjahr in %
0,Erwachsene,2017,690974.0,2016,653801.0,6.0
1,Ermaesigte,2017,160409.0,2016,163532.0,-2.0
2,Kinder,2017,107606.0,2016,101820.0,6.0
3,Familien,2017,262132.0,2016,211813.0,24.0
4,Andere Eintrittsgelder,2017,17662.0,2016,23932.0,-26.0
5,Summe Tagestickets Zoo,2017,1238783.0,2016,1154898.0,7.0

In [41]:
Tagestickets_Zoo.to_json('../../Data/Berlin/Tagestickets_Zoo.json', index=False)

### Tagestickets ZooAquarium

In [18]:
Tagestickets_ZooAquarium = dfs_list[2]
cols = list(Tagestickets_ZooAquarium.columns)
Tagestickets_ZooAquarium = B.eintrittskarten(df=Tagestickets_ZooAquarium, list_cols=cols, year=2017, past_year=2016)
Tagestickets_ZooAquarium

TypeError: Berlin.eintrittskarten() missing 1 required positional argument: 'self'